In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import statsmodels.api as sm
import seaborn as sns
sns.set()
from sklearn.linear_model import LinearRegression

In [2]:
raw_data=pd.read_csv('1.03.+Dummies.csv')

In [3]:
raw_data

     SAT   GPA Attendance
0   1714  2.40         No
1   1664  2.52         No
2   1760  2.54         No
3   1685  2.74         No
4   1693  2.83         No
..   ...   ...        ...
79  1936  3.71        Yes
80  1810  3.71        Yes
81  1987  3.73         No
82  1962  3.76        Yes
83  2050  3.81        Yes

[84 rows x 3 columns]

In [4]:
data=raw_data.copy()

In [5]:
data['Attendance']=data['Attendance'].map({'No':0,'Yes':1})

In [7]:
data.head()

    SAT   GPA  Attendance
0  1714  2.40           0
1  1664  2.52           0
2  1760  2.54           0
3  1685  2.74           0
4  1693  2.83           0

In [8]:
data.describe(include='all')

               SAT        GPA  Attendance
count    84.000000  84.000000   84.000000
mean   1845.273810   3.330238    0.464286
std     104.530661   0.271617    0.501718
min    1634.000000   2.400000    0.000000
25%    1772.000000   3.190000    0.000000
50%    1846.000000   3.380000    0.000000
75%    1934.000000   3.502500    1.000000
max    2050.000000   3.810000    1.000000

In [9]:
x=data[['SAT','Attendance']]
y=data['GPA']

In [10]:
x.shape

(84, 2)

In [11]:
y.shape

(84,)

In [12]:
reg=LinearRegression()

In [13]:
reg.fit(x,y)

LinearRegression()

In [14]:
reg.score(x,y)

0.5654390486739878

In [15]:
reg.intercept_

0.6438504592803018

In [16]:
reg.coef_

array([0.0013998 , 0.22264409])

In [17]:
x

     SAT  Attendance
0   1714           0
1   1664           0
2   1760           0
3   1685           0
4   1693           0
..   ...         ...
79  1936           1
80  1810           1
81  1987           0
82  1962           1
83  2050           1

[84 rows x 2 columns]

In [18]:
new_data=pd.DataFrame({'SAT':[1800,1750],'Attendance':[0,1]})

In [19]:
new_data

    SAT  Attendance
0  1800           0
1  1750           1

In [20]:
prediciton=reg.predict(new_data)

In [21]:
prediciton

array([3.16349328, 3.31614729])

In [24]:
predicteddf=pd.DataFrame({'prediction':prediciton})

In [25]:
predicteddf

   prediction
0    3.163493
1    3.316147

In [27]:
joined=new_data.join(predicteddf)
joined

    SAT  Attendance  prediction
0  1800           0    3.163493
1  1750           1    3.316147

In [28]:
joined=joined.rename(index={0:'shubham',1:'rupesh'})

In [29]:
joined

          SAT  Attendance  prediction
shubham  1800           0    3.163493
rupesh   1750           1    3.316147

In [30]:
joined['Attendance']=joined['Attendance'].map({0:'No',1:'Yes'})

In [31]:
joined

          SAT Attendance  prediction
shubham  1800         No    3.163493
rupesh   1750        Yes    3.316147